{
  "title": "Rizal Law (RA 1425)",
  "subtitle": "Republic Act No. 1425 - An Act to Include in the Curricula",
  "sections": [
    {
      "id": "summary",
      "icon": "📋",
      "title": "Summary of RA 1425",
      "type": "summary_section",
      "content": {
        "paragraphs": [
          "Republic Act No. 1425, known as the **Rizal Law**, was enacted on June 12, 1956. This law mandates the inclusion of courses on the life, works, and writings of José Rizal, particularly his novels *Noli Me Tangere* and *El Filibusterismo*, in the curricula of all public and private schools, colleges, and universities.",
          "The law aims to rekindle the patriotic spirit of Filipino youth and inspire them with the ideals of freedom and nationalism that Rizal embodied."
        ]
      }
    },
    {
      "id": "objectives",
      "icon": "🎯",
      "title": "Objectives of the Law",
      "type": "objectives_list",
      "content": {
        "objectives": [
          "To rededicate the lives of youth to the ideals of freedom and nationalism",
          "To foster love of country, heroism, and national ideals",
          "To gain an inspiring source of patriotism through the study of Rizal's life and works",
          "To strengthen national consciousness and pride in being Filipino"
        ]
      }
    },
    {
      "id": "importance",
      "icon": "⭐",
      "title": "Comprehensive Importance of Studying Rizal",
      "type": "detailed_importance",
      "content": {
        "educational_goals": [
          {
            "title": "Historical Consciousness and National Identity",
            "description": "Develops deep understanding of Philippine colonial history and the roots of Filipino nationalism",
            "specific_outcomes": [
              "Understanding of Spanish colonial system and its impact on Filipino society",
              "Knowledge of 19th century reform movements and their significance",
              "Appreciation of the peaceful approach to social change advocated by Rizal",
              "Recognition of continuity between past struggles and contemporary issues"
            ]
          },
          {
            "title": "Moral and Ethical Development",
            "description": "Instills fundamental Filipino values and universal ethical principles through Rizal's example",
            "specific_outcomes": [
              "Love of country (patriotism) without hatred of other nations",
              "Commitment to truth, justice, and human dignity",
              "Importance of education and continuous learning",
              "Courage to stand for principles despite personal cost",
              "Respect for human rights and social justice"
            ]
          },
          {
            "title": "Critical Thinking and Analytical Skills",
            "description": "Develops intellectual abilities through examination of complex historical and literary texts",
            "specific_outcomes": [
              "Analysis of primary source documents and historical evidence",
              "Literary criticism and interpretation of novels and essays",
              "Evaluation of different historical perspectives and narratives",
              "Understanding of cause-and-effect relationships in history",
              "Ability to connect past events with contemporary issues"
            ]
          },
          {
            "title": "Cultural Appreciation and Global Perspective",
            "description": "Strengthens Filipino cultural identity while promoting international understanding",
            "specific_outcomes": [
              "Pride in Filipino heritage and cultural achievements",
              "Understanding of cultural diversity and tolerance",
              "Appreciation of Philippines' place in world history",
              "Recognition of universal human values across cultures",
              "Preparation for global citizenship and international cooperation"
            ]
          }
        ],
        "contemporary_relevance": {
          "title": "Relevance to Modern Filipino Society:",
          "applications": [
            "Democratic citizenship and civic participation",
            "Social reform through peaceful and legal means",
            "Educational excellence and lifelong learning",
            "Cultural preservation in a globalized world",
            "Ethical leadership in public and private sectors",
            "International relations based on mutual respect"
          ]
        },
        "pedagogical_benefits": {
          "title": "Educational and Pedagogical Value:",
          "benefits": [
            "Integrates multiple disciplines: history, literature, philosophy, politics",
            "Provides role models for Filipino youth",
            "Encourages reading and appreciation of classic literature",
            "Develops research and writing skills",
            "Promotes discussion and debate on important issues",
            "Connects academic learning with practical life applications"
          ]
        }
      }
    },
    {
      "id": "full-text",
      "icon": "📜",
      "title": "Full Text of RA 1425",
      "type": "legal_document",
      "content": {
        "official_title": "REPUBLIC ACT NO. 1425",
        "subtitle": "AN ACT TO INCLUDE IN THE CURRICULA OF ALL PUBLIC AND PRIVATE SCHOOLS, COLLEGES AND UNIVERSITIES COURSES ON THE LIFE, WORKS AND WRITINGS OF JOSE RIZAL, PARTICULARLY HIS NOVELS NOLI ME TANGERE AND EL FILIBUSTERISMO, AUTHORIZING THE PRINTING AND DISTRIBUTION THEREOF, AND FOR OTHER PURPOSES",
        "sections": [
          {
            "number": "1",
            "text": "Courses on the life, works and writings of Jose Rizal, particularly his novels Noli Me Tangere and El Filibusterismo, shall be included in the curricula of all schools, colleges and universities, public or private: Provided, That in the collegiate courses, the original or unexpurgated editions of the Noli Me Tangere and El Filibusterismo or their English translation shall be used as basic texts."
          },
          {
            "number": "2",
            "text": "It shall be obligatory on all schools, colleges and universities to keep in their libraries an adequate number of copies of the original and unexpurgated editions of the Noli Me Tangere and El Filibusterismo, as well as of Rizal's other works and biography. The said unexpurgated editions of the Noli Me Tangere and El Filibusterismo or their translations in English as well as other writings of Rizal shall be included in the list of approved books for required reading in all public or private schools, colleges and universities."
          },
          {
            "number": "3",
            "text": "The Board of National Education is hereby authorized and directed to adopt forthwith measures to implement and carry out the provisions of this Section, including the writing and printing of appropriate primers, readers and textbooks. The Board shall, within sixty (60) days from the effectivity of this Act, promulgate rules and regulations, including those of a disciplinary nature, to carry out and enforce the provisions of this Act. The Board shall promulgate rules and regulations providing for the exemption of students for reasons of religious belief stated in a sworn written statement, from the requirement of reading the original and unexpurgated editions of the Noli Me Tangere and El Filibusterismo. Such rules and regulations shall take effect thirty (30) days after their publication in the Official Gazette."
          },
          {
            "number": "4",
            "text": "Nothing in this Act shall be construed as amendment or repealing section nine hundred twenty-seven of the Administrative Code, prohibiting the discussion of religious doctrines by public school teachers and other person engaged in any public school."
          },
          {
            "number": "5",
            "text": "The sum of three hundred thousand pesos is hereby authorized to be appropriated out of any fund not otherwise appropriated in the National Treasury to carry out the purposes of this Act."
          },
          {
            "number": "6",
            "text": "This Act shall take effect upon its approval."
          }
        ],
        "approval_date": "Approved: June 12, 1956"
      }
    },
    {
      "id": "curriculum-integration",
      "icon": "🏫",
      "title": "Integration in Schools and Curriculum",
      "type": "curriculum_levels",
      "content": {
        "levels": [
          {
            "level": "Elementary Level",
            "description": "Introduction to Rizal's life story, heroism, and basic values through age-appropriate materials."
          },
          {
            "level": "Secondary Level",
            "description": "Comprehensive study of Rizal's biography, historical context, and selected works and writings."
          },
          {
            "level": "College Level",
            "description": "Critical analysis of Noli Me Tangere and El Filibusterismo, plus in-depth study of his philosophy and impact on Philippine society."
          }
        ]
      }
    }
  ]
} 